app/nibble-api/app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "rob@dragonwrench.com"]]
---
  def create
    resource = User.find_for_database_authentication(:email => params[:user][:email])

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["authentication_token", "yLq4TxpWs_zpDWj7abaD"]]
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2016-05-05 01:11:37.523266"], ["current_sign_in_at", "2016-05-05 01:11:40.357420"], ["sign_in_count", 9], ["updated_at", "2016-05-05 01:11:40.358896"], ["id", 1]]
---
  def destroy
    @resource = User.find_by_authentication_token(params[:auth_token] || request.headers["x-auth-token"])
    return render :status => 401, :json => {errors: ['invalid auth token']} unless @resource

    @resource.update_attributes(:authentication_token => nil) #dunno why the reset does nothing